// This is a JavaScript file

app.value('questionsService', {
	questions : [
            {
            "text": "国内の色覚異常者の人数は約何人？",
            "answer": "約350万人",
            "choices": ["約400万人","約200万人","150万人"]
          },
          {
            "text": "波長を認識する錐体細胞のうち正しくないものはどれ？",
            "answer": "N錐体",
            "choices": ["M錐体","L錐体","S錐体"]
          },
          {
            "text": "錐体のうち、中程度の波長に感度が高いM錐体の異常により起こる色覚特性をもつ色覚タイプはどれ？",
            "answer": "D型",
            "choices": ["P型","クワガタ","T型"]
          },
          {
            "text": "最も波長の長い光に感度が高いL錐体（赤）の異常により起こる色覚特性を持つP型が見分けづらい色の組み合わせはどれ？",
            "answer": "黒と赤",
            "choices": ["オレンジと緑","グレーと水色","青と紫"]
          },
          {
            "text": "色覚の個人差を問わずに、できるだけ多くの人々にとって見やすいように配慮することをなんという？",
            "answer": "カラーユニバーサルデザイン",
            "choices": ["バリアフリー","ノーマライゼーション","ピクトグラム"]
          },
          {
            "text": "色の機能的役割として、ヒトの目をひきつける度合いや注意をむけていない対象の発見されやすさをなんという？",
            "answer": "誘目性",
            "choices": ["視認性","明視性","識別性"]
          },
          {
            "text": "グラフ等を色分けをして使用する際に色覚異常の人にもわかりやすい改善例として適切でないものはどれ？",
            "answer": "色を増やす",
            "choices": ["柄を使用する","枠をつける","文字を入れる"]
          }
        ]
});